#include "renderer.h"

extern ShaderVaryingData MyVertexShader(const Vertex& input_vertex);
extern Vec4f MyFragmentShader(const ShaderVaryingData& input_shader_varying_data);

std::vector<Vertex> vertex_buffer = {
    //坐标                //法线               //颜色rgb
    {{-0.5f, -0.5f, -0.5f}, {0.0f,  0.0f, -1.0f}, {1.0f, 0.5f, 0.31f}},
    {{ 0.5f, -0.5f, -0.5f}, {0.0f,  0.0f, -1.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, -0.5f}, {0.0f,  0.0f, -1.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, -0.5f}, {0.0f,  0.0f, -1.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  0.5f, -0.5f}, {0.0f,  0.0f, -1.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, -0.5f}, {0.0f,  0.0f, -1.0f},{1.0f, 0.5f, 0.31f}},

    {{-0.5f, -0.5f, 0.5f}, {0.0f,  0.0f, 1.0f}, {1.0f, 0.5f, 0.31f}},
    {{ 0.5f, -0.5f, 0.5f}, {0.0f,  0.0f, 1.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, 0.5f}, {0.0f,  0.0f, 1.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, 0.5f}, {0.0f,  0.0f, 1.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  0.5f, 0.5f}, {0.0f,  0.0f, 1.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, 0.5f}, {0.0f,  0.0f, 1.0f},{1.0f, 0.5f, 0.31f}},

    {{-0.5f, 0.5f, 0.5f}, {-1.0f,  0.0f, 0.0f}, {1.0f, 0.5f, 0.31f}},
    {{-0.5f, 0.5f, -0.5f}, {-1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, -0.5f}, {-1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, -0.5f}, {-1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, 0.5f}, {-1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  0.5f, 0.5f}, {-1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},

    {{0.5f, 0.5f, 0.5f}, {1.0f,  0.0f, 0.0f}, {1.0f, 0.5f, 0.31f}},
    {{0.5f, 0.5f, -0.5f}, {1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  -0.5f, -0.5f}, {1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  -0.5f, -0.5f}, {1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  -0.5f, 0.5f}, {1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, 0.5f}, {1.0f,  0.0f, 0.0f},{1.0f, 0.5f, 0.31f}},

    {{-0.5f, -0.5f, -0.5f}, {0.0f,  -1.0f, 0.0f}, {1.0f, 0.5f, 0.31f}},
    {{0.5f, -0.5f, -0.5f}, {0.0f,  -1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  -0.5f, 0.5f}, {0.0f,  -1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  -0.5f, 0.5f}, {0.0f,  -1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, 0.5f}, {0.0f,  -1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  -0.5f, -0.5f}, {0.0f,  -1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},

    {{-0.5f, 0.5f, -0.5f}, {0.0f,  1.0f, 0.0f}, {1.0f, 0.5f, 0.31f}},
    {{0.5f, 0.5f, -0.5f}, {0.0f,  1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, 0.5f}, {0.0f,  1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{0.5f,  0.5f, 0.5f}, {0.0f,  1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  0.5f, 0.5f}, {0.0f,  1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
    {{-0.5f,  0.5f, -0.5f}, {0.0f,  1.0f, 0.0f},{1.0f, 0.5f, 0.31f}},
};

std::vector<std::vector<int>> index_buffer = {
    {0,1,2},
    {3,4,5},

    {6,7,8},
    {9,10,11},

    {12, 13, 14},
    {15, 16, 17},

    {18, 19, 20},
    {21, 22, 23},

    {24, 25, 26},
    {27, 28, 29},

    {30, 31, 32},
    {33, 34, 35},
};

WindowCreaterInfo window_info = {
    "CoreEngine",
    600,
    600
};

int main(int argc, char* argv[]) {
    //着色器设置
    Shader shader;
    shader.SetVertexShader(MyVertexShader);
    shader.SetFragmentShader(MyFragmentShader);
    //各种缓冲区设置
    Buffer buffer;
    buffer.verter_buffer = vertex_buffer;
    buffer.index_buffer = index_buffer;
    //渲染器启动
    Renderer renderer(window_info, &shader);
    renderer.Run(buffer);
    return 0;
} 